FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_EFM32_Gecko_Starter_Kit_Simplicity_Studio/Source/SilLabs_Code/emlib/inc/em_ldma.h
/*******************************************************************************
 **************************   STRUCT INITIALIZERS   ****************************
 ******************************************************************************/


/** @brief Default DMA initialization structure. */
#define LDMA_INIT_DEFAULT                                                                   \
{                                                                                           \
  .ldmaInitCtrlNumFixed     = _LDMA_CTRL_NUMFIXED_DEFAULT, /* Fixed priority arbitration. */ \
  .ldmaInitCtrlSyncPrsClrEn = 0,                           /* No PRS Synctrig clear enable*/ \
  .ldmaInitCtrlSyncPrsSetEn = 0,                           /* No PRS Synctrig set enable. */ \
  .ldmaInitIrqPriority      = 3                            /* IRQ priority level 3.       */ \
}

/**
 * @brief
 *   Generic DMA transfer configuration for memory to memory transfers.
 */
#define LDMA_TRANSFER_CFG_MEMORY()              \
{                                               \
  0, 0, 0, 0, 0,                                \
  false, false, ldmaCfgArbSlotsAs1,             \
  ldmaCfgSrcIncSignPos, ldmaCfgDstIncSignPos, 0 \
}

/**
 * @brief
 *   Generic DMA transfer configuration for looped memory to memory transfers.
 */
#define LDMA_TRANSFER_CFG_MEMORY_LOOP( loopCnt) \
{                                               \
  0, 0, 0, 0, 0,                                \
  false, false, ldmaCfgArbSlotsAs1,             \
  ldmaCfgSrcIncSignPos, ldmaCfgDstIncSignPos,   \
  loopCnt                                       \
}

/**
 * @brief
 *   Generic DMA transfer configuration for memory to/from peripheral transfers.
 */
#define LDMA_TRANSFER_CFG_PERIPHERAL( signal )  \
{                                               \
  signal, 0, 0, 0, 0,                           \
  false, false, ldmaCfgArbSlotsAs1,             \
  ldmaCfgSrcIncSignPos, ldmaCfgDstIncSignPos, 0 \
}

/**
 * @brief
 *   Generic DMA transfer configuration for looped memory to/from peripheral transfers.
 */
#define LDMA_TRANSFER_CFG_PERIPHERAL_LOOP( signal, loopCnt )  \
{                                                             \
  signal, 0, 0, 0, 0,                                         \
  false, false, ldmaCfgArbSlotsAs1,                           \
  ldmaCfgSrcIncSignPos, ldmaCfgDstIncSignPos, loopCnt         \
}

/**
 * @brief
 *   DMA descriptor initializer for single memory to memory word transfer.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of words to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2M_WORD( src, dest, count ) \
{                                                           \
  .xfer =                                                   \
  {                                                         \
    .structType   = ldmaCtrlStructTypeXfer,                 \
    .structReq    = 1,                                      \
    .xferCnt      = ( count ) - 1,                          \
    .byteSwap     = 0,                                      \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                 \
    .doneIfs      = 1,                                      \
    .reqMode      = ldmaCtrlReqModeAll,                     \
    .decLoopCnt   = 0,                                      \
    .ignoreSrec   = 0,                                      \
    .srcInc       = ldmaCtrlSrcIncOne,                      \
    .size         = ldmaCtrlSizeWord,                       \
    .dstInc       = ldmaCtrlDstIncOne,                      \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                 \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                 \
    .srcAddr      = (uint32_t)(src),                        \
    .dstAddr      = (uint32_t)(dest),                       \
    .linkMode     = 0,                                      \
    .link         = 0,                                      \
    .linkAddr     = 0                                       \
  }                                                         \
}

/**
 * @brief
 *   DMA descriptor initializer for single memory to memory half-word transfer.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of half-words to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2M_HALF( src, dest, count ) \
{                                                           \
  .xfer =                                                   \
  {                                                         \
    .structType   = ldmaCtrlStructTypeXfer,                 \
    .structReq    = 1,                                      \
    .xferCnt      = ( count ) - 1,                          \
    .byteSwap     = 0,                                      \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                 \
    .doneIfs      = 1,                                      \
    .reqMode      = ldmaCtrlReqModeAll,                     \
    .decLoopCnt   = 0,                                      \
    .ignoreSrec   = 0,                                      \
    .srcInc       = ldmaCtrlSrcIncOne,                      \
    .size         = ldmaCtrlSizeHalf,                       \
    .dstInc       = ldmaCtrlDstIncOne,                      \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                 \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                 \
    .srcAddr      = (uint32_t)(src),                        \
    .dstAddr      = (uint32_t)(dest),                       \
    .linkMode     = 0,                                      \
    .link         = 0,                                      \
    .linkAddr     = 0                                       \
  }                                                         \
}

/**
 * @brief
 *   DMA descriptor initializer for single memory to memory byte transfer.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2M_BYTE( src, dest, count ) \
{                                                           \
  .xfer =                                                   \
  {                                                         \
    .structType   = ldmaCtrlStructTypeXfer,                 \
    .structReq    = 1,                                      \
    .xferCnt      = ( count ) - 1,                          \
    .byteSwap     = 0,                                      \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                 \
    .doneIfs      = 1,                                      \
    .reqMode      = ldmaCtrlReqModeAll,                     \
    .decLoopCnt   = 0,                                      \
    .ignoreSrec   = 0,                                      \
    .srcInc       = ldmaCtrlSrcIncOne,                      \
    .size         = ldmaCtrlSizeByte,                       \
    .dstInc       = ldmaCtrlDstIncOne,                      \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                 \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                 \
    .srcAddr      = (uint32_t)(src),                        \
    .dstAddr      = (uint32_t)(dest),                       \
    .linkMode     = 0,                                      \
    .link         = 0,                                      \
    .linkAddr     = 0                                       \
  }                                                         \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory word transfer.
 *
 *   The link address must be an absolute address.
 * @note
 *   The linkAddr member of the transfer descriptor is not
 *   initialized.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of words to transfer.
 */
#define LDMA_DESCRIPTOR_LINKABS_M2M_WORD( src, dest, count ) \
{                                                            \
  .xfer =                                                    \
  {                                                          \
    .structType   = ldmaCtrlStructTypeXfer,                  \
    .structReq    = 1,                                       \
    .xferCnt      = ( count ) - 1,                           \
    .byteSwap     = 0,                                       \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                  \
    .doneIfs      = 0,                                       \
    .reqMode      = ldmaCtrlReqModeAll,                      \
    .decLoopCnt   = 0,                                       \
    .ignoreSrec   = 0,                                       \
    .srcInc       = ldmaCtrlSrcIncOne,                       \
    .size         = ldmaCtrlSizeWord,                        \
    .dstInc       = ldmaCtrlDstIncOne,                       \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                  \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                  \
    .srcAddr      = (uint32_t)(src),                         \
    .dstAddr      = (uint32_t)(dest),                        \
    .linkMode     = ldmaLinkModeAbs,                         \
    .link         = 1,                                       \
    .linkAddr     = 0   /* Must be set runtime ! */          \
  }                                                          \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory half-word transfer.
 *
 *   The link address must be an absolute address.
 * @note
 *   The linkAddr member of the transfer descriptor is not
 *   initialized.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of half-words to transfer.
 */
#define LDMA_DESCRIPTOR_LINKABS_M2M_HALF( src, dest, count ) \
{                                                            \
  .xfer =                                                    \
  {                                                          \
    .structType   = ldmaCtrlStructTypeXfer,                  \
    .structReq    = 1,                                       \
    .xferCnt      = ( count ) - 1,                           \
    .byteSwap     = 0,                                       \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                  \
    .doneIfs      = 0,                                       \
    .reqMode      = ldmaCtrlReqModeAll,                      \
    .decLoopCnt   = 0,                                       \
    .ignoreSrec   = 0,                                       \
    .srcInc       = ldmaCtrlSrcIncOne,                       \
    .size         = ldmaCtrlSizeHalf,                        \
    .dstInc       = ldmaCtrlDstIncOne,                       \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                  \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                  \
    .srcAddr      = (uint32_t)(src),                         \
    .dstAddr      = (uint32_t)(dest),                        \
    .linkMode     = ldmaLinkModeAbs,                         \
    .link         = 1,                                       \
    .linkAddr     = 0   /* Must be set runtime ! */          \
  }                                                          \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory byte transfer.
 *
 *   The link address must be an absolute address.
 * @note
 *   The linkAddr member of the transfer descriptor is not
 *   initialized.
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_LINKABS_M2M_BYTE( src, dest, count ) \
{                                                            \
  .xfer =                                                    \
  {                                                          \
    .structType   = ldmaCtrlStructTypeXfer,                  \
    .structReq    = 1,                                       \
    .xferCnt      = ( count ) - 1,                           \
    .byteSwap     = 0,                                       \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                  \
    .doneIfs      = 0,                                       \
    .reqMode      = ldmaCtrlReqModeAll,                      \
    .decLoopCnt   = 0,                                       \
    .ignoreSrec   = 0,                                       \
    .srcInc       = ldmaCtrlSrcIncOne,                       \
    .size         = ldmaCtrlSizeByte,                        \
    .dstInc       = ldmaCtrlDstIncOne,                       \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                  \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                  \
    .srcAddr      = (uint32_t)(src),                         \
    .dstAddr      = (uint32_t)(dest),                        \
    .linkMode     = ldmaLinkModeAbs,                         \
    .link         = 1,                                       \
    .linkAddr     = 0   /* Must be set runtime ! */          \
  }                                                          \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory word transfer.
 *
 *   The link address is a relative address.
 * @note
 *   The linkAddr member of the transfer descriptor is
 *   initialized to 4, assuming that the next descriptor immediately follows
 *   this descriptor (in memory).
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of words to transfer.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_M2M_WORD( src, dest, count, linkjmp ) \
{                                                                     \
  .xfer =                                                             \
  {                                                                   \
    .structType   = ldmaCtrlStructTypeXfer,                           \
    .structReq    = 1,                                                \
    .xferCnt      = ( count ) - 1,                                    \
    .byteSwap     = 0,                                                \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                           \
    .doneIfs      = 0,                                                \
    .reqMode      = ldmaCtrlReqModeAll,                               \
    .decLoopCnt   = 0,                                                \
    .ignoreSrec   = 0,                                                \
    .srcInc       = ldmaCtrlSrcIncOne,                                \
    .size         = ldmaCtrlSizeWord,                                 \
    .dstInc       = ldmaCtrlDstIncOne,                                \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                           \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                           \
    .srcAddr      = (uint32_t)(src),                                  \
    .dstAddr      = (uint32_t)(dest),                                 \
    .linkMode     = ldmaLinkModeRel,                                  \
    .link         = 1,                                                \
    .linkAddr     = ( linkjmp ) * 4                                   \
  }                                                                   \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory half-word transfer.
 *
 *   The link address is a relative address.
 * @note
 *   The linkAddr member of the transfer descriptor is
 *   initialized to 4, assuming that the next descriptor immediately follows
 *   this descriptor (in memory).
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of half-words to transfer.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_M2M_HALF( src, dest, count, linkjmp ) \
{                                                                     \
  .xfer =                                                             \
  {                                                                   \
    .structType   = ldmaCtrlStructTypeXfer,                           \
    .structReq    = 1,                                                \
    .xferCnt      = ( count ) - 1,                                    \
    .byteSwap     = 0,                                                \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                           \
    .doneIfs      = 0,                                                \
    .reqMode      = ldmaCtrlReqModeAll,                               \
    .decLoopCnt   = 0,                                                \
    .ignoreSrec   = 0,                                                \
    .srcInc       = ldmaCtrlSrcIncOne,                                \
    .size         = ldmaCtrlSizeHalf,                                 \
    .dstInc       = ldmaCtrlDstIncOne,                                \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                           \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                           \
    .srcAddr      = (uint32_t)(src),                                  \
    .dstAddr      = (uint32_t)(dest),                                 \
    .linkMode     = ldmaLinkModeRel,                                  \
    .link         = 1,                                                \
    .linkAddr     = ( linkjmp ) * 4                                   \
  }                                                                   \
}

/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory byte transfer.
 *
 *   The link address is a relative address.
 * @note
 *   The linkAddr member of the transfer descriptor is
 *   initialized to 4, assuming that the next descriptor immediately follows
 *   this descriptor (in memory).
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=one this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_M2M_BYTE( src, dest, count, linkjmp ) \
{                                                                     \
  .xfer =                                                             \
  {                                                                   \
    .structType   = ldmaCtrlStructTypeXfer,                           \
    .structReq    = 1,                                                \
    .xferCnt      = ( count ) - 1,                                    \
    .byteSwap     = 0,                                                \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                           \
    .doneIfs      = 0,                                                \
    .reqMode      = ldmaCtrlReqModeAll,                               \
    .decLoopCnt   = 0,                                                \
    .ignoreSrec   = 0,                                                \
    .srcInc       = ldmaCtrlSrcIncOne,                                \
    .size         = ldmaCtrlSizeByte,                                 \
    .dstInc       = ldmaCtrlDstIncOne,                                \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                           \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                           \
    .srcAddr      = (uint32_t)(src),                                  \
    .dstAddr      = (uint32_t)(dest),                                 \
    .linkMode     = ldmaLinkModeRel,                                  \
    .link         = 1,                                                \
    .linkAddr     = ( linkjmp ) * 4                                   \
  }                                                                   \
}

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_P2M_BYTE( src, dest, count ) \
{                                                           \
  .xfer =                                                   \
  {                                                         \
    .structType   = ldmaCtrlStructTypeXfer,                 \
    .structReq    = 0,                                      \
    .xferCnt      = ( count ) - 1,                          \
    .byteSwap     = 0,                                      \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                 \
    .doneIfs      = 1,                                      \
    .reqMode      = ldmaCtrlReqModeBlock,                   \
    .decLoopCnt   = 0,                                      \
    .ignoreSrec   = 0,                                      \
    .srcInc       = ldmaCtrlSrcIncNone,                     \
    .size         = ldmaCtrlSizeByte,                       \
    .dstInc       = ldmaCtrlDstIncOne,                      \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                 \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                 \
    .srcAddr      = (uint32_t)(src),                        \
    .dstAddr      = (uint32_t)(dest),                       \
    .linkMode     = 0,                                      \
    .link         = 0,                                      \
    .linkAddr     = 0                                       \
  }                                                         \
}

